SoapService/SoapService/bin/Debug/request_xmlservice_.xml

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:ext='http://xmlns.esb.ru/ext/ExtCheck/'>
                <soapenv:Header/>
                <soapenv:Body>
                    <ext:setBillingCheckRequest>
                        <ext:system_id>63001</ext:system_id>
                        <ext:timestamp>08.05.2019 22:10</ext:timestamp>
                        <ext:external_id>123456309978</ext:external_id>
                        <ext:receipt>
                            <ext:client>
                                <ext:ls_number>ls1</ext:ls_number>
                            </ext:client>
                            <ext:items>
                                <ext:item>
                                    <ext:name>Tovar1</ext:name>
                                    <ext:price>22.10</ext:price>
                                    <ext:quantity>2</ext:quantity>
                                    <ext:sum>44.20</ext:sum>
                                    <ext:measurement_unit>en</ext:measurement_unit>
                                    <ext:payment_method>full_payment</ext:payment_method>
                                    <ext:payment_object>service</ext:payment_object>
                                    <ext:vat>
                                        <ext:type>vat20</ext:type>
                                        <ext:sum>4.10</ext:sum>
                                    </ext:vat>
                                    <ext:supplier_info>
                                        <ext:orgn>ogrn1</ext:orgn>
                                    </ext:supplier_info>
                                </ext:item>
                                <ext:item>
                                    <ext:name>Tovar2</ext:name>
                                    <ext:price>10</ext:price>
                                    <ext:quantity>1</ext:quantity>
                                    <ext:sum>20</ext:sum>
                                    <ext:measurement_unit>en</ext:measurement_unit>
                                    <ext:payment_method>full_payment</ext:payment_method>
                                    <ext:payment_object>service</ext:payment_object>
                                    <ext:vat>
                                        <ext:type>vat20</ext:type>
                                        <ext:sum>4</ext:sum>
                                    </ext:vat>
                                </ext:item>
                            </ext:items>
                            <ext:payments>
                                <ext:payment>
                                    <ext:type>1</ext:type>
                                    <ext:sum>64.20</ext:sum>
                                </ext:payment>
                            </ext:payments>
                            <ext:vats>
                                <ext:vat>
                                    <ext:type>vat20</ext:type>
                                    <ext:sum>8.10</ext:sum>
                                </ext:vat>
                            </ext:vats>
                            <ext:total>64.20</ext:total>
                        </ext:receipt>
                    </ext:setBillingCheckRequest>
                    <ext:setBillingCheckRequest>
                        <ext:system_id>63001</ext:system_id>
                        <ext:timestamp>08.05.2019 22:10</ext:timestamp>
                        <ext:external_id>123456309978</ext:external_id>
                        <ext:receipt>
                            <ext:client>
                                <ext:ls_number>ls2</ext:ls_number>
                            </ext:client>
                            <ext:items>
                                <ext:item>
                                    <ext:name>Tovar1</ext:name>
                                    <ext:price>22.10</ext:price>
                                    <ext:quantity>2</ext:quantity>
                                    <ext:sum>44.20</ext:sum>
                                    <ext:measurement_unit>en</ext:measurement_unit>
                                    <ext:payment_method>full_payment</ext:payment_method>
                                    <ext:payment_object>service</ext:payment_object>
                                    <ext:vat>
                                        <ext:type>vat20</ext:type>
                                        <ext:sum>4.10</ext:sum>
                                    </ext:vat>
                                    <ext:supplier_info>
                                        <ext:orgn>ogrn1</ext:orgn>
                                    </ext:supplier_info>
                                </ext:item>
                                <ext:item>
                                    <ext:name>Tovar2</ext:name>
                                    <ext:price>10</ext:price>
                                    <ext:quantity>1</ext:quantity>
                                    <ext:sum>20</ext:sum>
                                    <ext:measurement_unit>en</ext:measurement_unit>
                                    <ext:payment_method>full_payment</ext:payment_method>
                                    <ext:payment_object>service</ext:payment_object>
                                    <ext:vat>
                                        <ext:type>vat20</ext:type>
                                        <ext:sum>4</ext:sum>
                                    </ext:vat>
                                </ext:item>
                            </ext:items>
                            <ext:payments>
                                <ext:payment>
                                    <ext:type>1</ext:type>
                                    <ext:sum>64.20</ext:sum>
                                </ext:payment>
                            </ext:payments>
                            <ext:vats>
                                <ext:vat>
                                    <ext:type>vat20</ext:type>
                                    <ext:sum>8.10</ext:sum>
                                </ext:vat>
                            </ext:vats>
                            <ext:total>64.20</ext:total>
                        </ext:receipt>
                    </ext:setBillingCheckRequest>
                </soapenv:Body>
            </soapenv:Envelope>